# CloudPoint Fields (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CloudPoint Fields
CloudPoint Structure See Also
---
The CloudPoint type exposes the following members.
# Fields
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Color | The color |
| X | The X coordinate |
| Y | The Y coordinate |
| Z | The Z coordinate |

# See Also
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace